podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/LTC0_MKL82Z7.svd.xml
            <register>
               <name>CW</name>
               <description>LTC Clear Written Register</description>
               <addressOffset>0x40</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CM</name>
                     <description>Clear the Mode Register. Writing a one to this bit causes the Mode Register to be cleared</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CDS</name>
                     <description>Clear the Data Size Register</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CICV</name>
                     <description>Clear the ICV Size Register. Writing a one to this bit causes the ICV Size Register to be cleared</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCR</name>
                     <description>Clear the Context Register. Writing a one to this bit causes the Context Register to be cleared</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKR</name>
                     <description>Clear the Key Register</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPKA</name>
                     <description>Clear the PKHA A Size Register</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPKB</name>
                     <description>Clear the PKHA B Size Register</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPKN</name>
                     <description>Clear the PKHA N Size Register</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPKE</name>
                     <description>Clear the PKHA E Size Register</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COF</name>
                     <description>Clear Output FIFO. Writing a 1 to this bit causes the Output FIFO to be cleared</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CIF</name>
                     <description>Clear Input FIFO. Writing a 1 to this bit causes the Input Data FIFO</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STA</name>
               <description>LTC Status Register</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>AB</name>
                     <description>AESA Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>AESA Idle</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>AESA Busy</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DB</name>
                     <description>DESA Busy</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>DESA Idle</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>DESA Busy</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PB</name>
                     <description>PKHA Busy</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PKHA Idle</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>PKHA Busy</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MB</name>
                     <description>MDHA Busy</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>MDHA Idle</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>MDHA Busy</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DI</name>
                     <description>Done Interrupt</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EI</name>
                     <description>Error Interrupt</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Not Error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Error Interrupt</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DPARRN</name>
                     <description>This bit is asserted after POR and after every 50K blocks processed by AESA to indicate it is advisable for added security to write a new seed to</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PKP</name>
                     <description>Public Key is Prime</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PKO</name>
                     <description>Public Key Operation is One</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PKZ</name>
                     <description>Public Key Operation is Zero</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ESTA</name>
               <description>LTC Error Status Register</description>
               <addressOffset>0x4C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRID1</name>
                     <description>Error ID 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>Mode Error</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>Data Size Error, including PKHA N Register Size Error</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0011</name>
                           <description>Key Size Error, including PKHA E Register Size Error</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>PKHA A Register Size Error</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0101</name>
                           <description>PKHA B Register Size Error</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>Data Arrived out of Sequence Error</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>PKHA Divide by Zero Error</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>PKHA Modulus Even Error</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>DES Key Parity Error</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1010</name>
                           <description>ICV Check Failed</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1011</name>
                           <description>Internal Hardware Failure</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1100</name>
                           <description>CCM AAD Size Error (either 1. AAD flag in B0 =1 and no AAD type provided, 2. AAD flag in B0 = 0 and AAD povided, or 3. AAD flag in B0 =1 and not enough AAD provided - expecting more based on AAD size.)</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1111</name>
                           <description>Invalid Crypto Engine Selected</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CL1</name>
                     <description>algorithms. The algorithms field indicates which algorithm is asserting an error. Others reserved</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>LTC General Error</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0001</name>
                           <description>AES</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>DES</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>MDHA</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>Public Key</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>AADSZ</name>
               <description>LTC AAD Size Register</description>
               <addressOffset>0x58</addressOffset>
               <fields>
                  <field>
                     <name>AADSZ</name>
                     <description>AAD size in Bytes, mod 16</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AL</name>
                     <description>AAD Last. Only AAD data will be written into the Input FIFO</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IVSZ</name>
               <description>LTC IV Size Register</description>
               <addressOffset>0x60</addressOffset>
               <fields>
                  <field>
                     <name>IVSZ</name>
                     <description>IV size in Bytes, mod 16</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>IL</name>
                     <description>IV Last. Only IV data will be written into the Input FIFO</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPAMS</name>
               <description>LTC DPA Mask Seed Register</description>
               <addressOffset>0x68</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DPAMS</name>
                     <description>Differential Power Analysis Mask Seed</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKASZ</name>
               <description>LTC PKHA A Size Register</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>PKASZ</name>
                     <description>PKHA A Size. This is the size of the numeric value, in bytes, contained within the PKHA A Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKBSZ</name>
               <description>LTC PKHA B Size Register</description>
               <addressOffset>0x88</addressOffset>
               <fields>
                  <field>
                     <name>PKBSZ</name>
                     <description>PKHA B Size. This is the size of the numeric value, in bytes, contained within the PKHA B Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKNSZ</name>
               <description>LTC PKHA N Size Register</description>
               <addressOffset>0x90</addressOffset>
               <fields>
                  <field>
                     <name>PKNSZ</name>
                     <description>PKHA N Size. This is the size of the numeric value, in bytes, contained within the PKHA N Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PKESZ</name>
               <description>LTC PKHA E Size Register</description>
               <addressOffset>0x98</addressOffset>
               <fields>
                  <field>
                     <name>PKESZ</name>
                     <description>PKHA E Size. This is the size of the numeric value, in bytes, contained within the PKHA E Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>CTX%s</name>
               <description>LTC Context Register</description>
               <addressOffset>0x100</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>CTX</name>
                     <description>CTX</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
               <name>KEY%s</name>
               <description>LTC Key</description>
               <addressOffset>0x200</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>KEY</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>VID1</name>
               <description>LTC Version ID Register</description>
               <addressOffset>0x4F0</addressOffset>
               <access>read-only</access>
               <resetValue>0x340100</resetValue>
               <fields>
                  <field>
                     <name>MIN_REV</name>
                     <description>Minor revision number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MAJ_REV</name>
                     <description>Major revision number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IP_ID</name>
                     <description>ID(0x0038)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VID2</name>
               <description>LTC Version ID 2 Register</description>
               <addressOffset>0x4F4</addressOffset>
               <access>read-only</access>
               <resetValue>0x101</resetValue>
               <fields>
                  <field>
                     <name>ECO_REV</name>
                     <description>ECO revision number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ARCH_ERA</name>
                     <description>Architectural ERA</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
