podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/LTC0_MKL82Z7.svd.xml
            <register>
               <name>CHAVID</name>
               <description>LTC CHA Version ID Register</description>
               <addressOffset>0x4F8</addressOffset>
               <access>read-only</access>
               <resetValue>0x40440251</resetValue>
               <fields>
                  <field>
                     <name>AESREV</name>
                     <description>AES Revision Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AESVID</name>
                     <description>AES Version ID</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DESREV</name>
                     <description>DES Revision Number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DESVID</name>
                     <description>DES Version ID(0x0). 0000 - High-performance DESA 0001 - Low-performance DESA</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PKHAREV</name>
                     <description>PK Revision Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PKHAVID</name>
                     <description>PK Version ID 0001 - 32-bit PKHA-SD 0010 - 64-bit PKHA-SD 0011 - 128-bit PKHA-SD 0100 - 16-bit PKHA-SD</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MDHAREV</name>
                     <description>MDHA Revision Number</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MDHAVID</name>
                     <description>MDHA Hashing Version ID</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FIFOSTA</name>
               <description>LTC FIFO Status Register</description>
               <addressOffset>0x7C0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>IFL</name>
                     <description>Input FIFO Level. These bits indicate the current number of entries in the Input FIFO</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>IFF</name>
                     <description>Input FIFO Full. The Input FIFO is full and should not be written to</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFL</name>
                     <description>Output FIFO Level. These bits indicate the current number of entries in the Output FIFO</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>OFF</name>
                     <description>Output FIFO Full. The Output FIFO is full and should not be written to</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IFIFO</name>
               <description>LTC Input Data FIFO</description>
               <addressOffset>0x7E0</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IFIFO</name>
                     <description>IFIFO</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>OFIFO</name>
               <description>LTC Output Data FIFO</description>
               <addressOffset>0x7F0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>OFIFO</name>
                     <description>Output FIFO</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>64</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63</dimIndex>
               <name>PKA%s</name>
               <description>LTC PKHA A %s Register</description>
               <addressOffset>0x800</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetMask>0x0</resetMask>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKA0%s</name>
               <description>LTC PKHA A%s 0 Register</description>
               <addressOffset>0x800</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_A0</name>
                     <description>A0 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKA1%s</name>
               <description>LTC PKHA A1 %s Register</description>
               <addressOffset>0x840</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_A1</name>
                     <description>A1 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKA2%s</name>
               <description>LTC PKHA A2 %s Register</description>
               <addressOffset>0x880</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_A2</name>
                     <description>A2 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKA3%s</name>
               <description>LTC PKHA A3 %s Register</description>
               <addressOffset>0x8C0</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_A3</name>
                     <description>A3 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>64</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63</dimIndex>
               <name>PKB%s</name>
               <description>LTC PKHA B %s Register</description>
               <addressOffset>0xA00</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetMask>0x0</resetMask>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKB0%s</name>
               <description>LTC PKHA B%s 0 Register</description>
               <addressOffset>0xA00</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_B0</name>
                     <description>B0 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKB1%s</name>
               <description>LTC PKHA B1 %s Register</description>
               <addressOffset>0xA40</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_B1</name>
                     <description>B1 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKB2%s</name>
               <description>LTC PKHA B2 %s Register</description>
               <addressOffset>0xA80</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_B2</name>
                     <description>B2 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKB3%s</name>
               <description>LTC PKHA B3 %s Register</description>
               <addressOffset>0xAC0</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_B3</name>
                     <description>B3 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>64</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63</dimIndex>
               <name>PKN%s</name>
               <description>LTC PKHA N %s Register</description>
               <addressOffset>0xC00</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetMask>0x0</resetMask>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKN0%s</name>
               <description>LTC PKHA N%s 0 Register</description>
               <addressOffset>0xC00</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_N0</name>
                     <description>N0 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKN1%s</name>
               <description>LTC PKHA N1 %s Register</description>
               <addressOffset>0xC40</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_N1</name>
                     <description>N1 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKN2%s</name>
               <description>LTC PKHA N2 %s Register</description>
               <addressOffset>0xC80</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_N2</name>
                     <description>N2 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKN3%s</name>
               <description>LTC PKHA N3 %s Register</description>
               <addressOffset>0xCC0</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_N3</name>
                     <description>N3 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>64</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63</dimIndex>
               <name>PKE%s</name>
               <description>LTC PKHA E %s Register</description>
               <addressOffset>0xE00</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetMask>0x0</resetMask>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKE0%s</name>
               <description>LTC PKHA E%s 0 Register</description>
               <addressOffset>0xE00</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_E0</name>
                     <description>E0 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKE1%s</name>
               <description>LTC PKHA E1 %s Register</description>
               <addressOffset>0xE40</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_E1</name>
                     <description>E1 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKE2%s</name>
               <description>LTC PKHA E2 %s Register</description>
               <addressOffset>0xE80</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_E2</name>
                     <description>E2 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>PKE3%s</name>
               <description>LTC PKHA E3 %s Register</description>
               <addressOffset>0xEC0</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>PKHA_E3</name>
                     <description>E3 VALUE</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
